<?php
var_dump(__FILE__); echo "<br>"; // указывает путь от файла до корня

var_dump(__LINE__); echo "<br>"; // выводит номер строки, на которой она была использована

var_dump(__DIR__); echo "<br>"; // выводит путь к папке, в которой лежит исполняемый файл

var_dump(__FUNCTION__); echo "<br>"; // выводит название исполняемой функции

var_dump(__CLASS__); echo "<br>"; // выводит название исполняемого класса

var_dump(__METHOD__); echo "<br>"; // выводит название исполняемого метода в классе

var_dump(__NAMESPACE__); echo "<br>"; // выводит название пространства имен

